{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 1536,
  "initializer_range": 0.02,
  "intermediate_size": 4864,
  "max_position_embeddings": 32768,
  "model_type": "llama",
  "num_attention_heads": 24,
  "num_key_value_heads": 8,
  "num_hidden_layers": 1,
  "pad_token_id": 2,
  "rms_norm_eps": 1e-06,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.28.1",
  "use_cache": true,
  "vocab_size": 73448,
  "draft_vocab_size": 14224,
  "rope_scaling":{"type":"linear","factor":2.0}
}